<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"fcefe854312e6056445b6a3296dedc5b9da3051b6d1e499e7b67c12748ce2a01","plan_job_ref":"Job Plan Airflow DAGs #178 at https://github.com/cal-itp/data-infra/actions/runs/16063047489","plan_out_hash":"0b0e64fac85b4eededd849b498490b46e1ffe64c3ae2deb3f8adc37248a3d560","plan_hash":"bca7f835240debe2597b6c3db32e0cc494f7d3e912dfb3da60c0205424f99a61","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 1 to add, 2 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer["dags/create_external_tables/airtable/external_airtable_california_transit_ntd_agency_info.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "O6VdsQ==" -> (known after apply)
!~      detect_md5hash      = "c7P1BXjTanwkHuRdyRoP3w==" -> "different hash"
!~      generation          = 1751587159437928 -> (known after apply)
        id                  = "calitp-composer-dags/create_external_tables/airtable/external_airtable_california_transit_ntd_agency_info.yml"
!~      md5hash             = "c7P1BXjTanwkHuRdyRoP3w==" -> (known after apply)
        name                = "dags/create_external_tables/airtable/external_airtable_california_transit_ntd_agency_info.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/staging/transit_database/stg_transit_database__ntd_agency_info.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "k5eeXg==" -> (known after apply)
!~      detect_md5hash      = "pUTstkczZnIZlZDGn/Du/A==" -> "different hash"
!~      generation          = 1751416662021283 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/models/staging/transit_database/stg_transit_database__ntd_agency_info.sql"
!~      md5hash             = "pUTstkczZnIZlZDGn/Du/A==" -> (known after apply)
        name                = "data/warehouse/models/staging/transit_database/stg_transit_database__ntd_agency_info.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-partial_parse will be created
+   resource "google_storage_bucket_object" "calitp-composer-partial_parse" {
+       bucket         = "calitp-composer"
+       content        = (sensitive value)
+       content_type   = "application/vnd.msgpack"
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "data/warehouse/target/partial_parse.msgpack"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       storage_class  = (known after apply)
    }

Plan: 1 to add, 2 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Airflow DAGs #178](https://github.com/cal-itp/data-infra/actions/runs/16063047489)